import 'package:get/get.dart';

class Messages extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        'zh_CN': {
          '首页': '首页',
          '客户名称:': '客户名称:',
          '客户电话:': '客户电话:',
          '客户地址:': '客户地址:',
          '位置照片:': '位置照片:',
          '通知': '通知',
          '未查询到地址信息': '未查询到地址信息',
          '客户无定位信息': '客户无定位信息:',
          '运单编号/会员编号': '运单编号/会员编号',
          '数据加载中..': '数据加载中..',
          '网络错误': '网络错误',
          '用户名或者密码错误!': '用户名或者密码错误!',
          '请求失败! 请稍后尝试!': '请求失败! 请稍后尝试!',
        },
        'ca_KH': {
          '首页': 'ទំព័រដើម:',
          '客户名称:': 'ឈ្មោះអតិថិជន:',
          '客户电话:': 'លេខទូរស័ព្ទអតិថិជន:',
          '客户地址:': 'អាសយដ្ឋានអតិថិជន:',
          '位置照片:': 'រូបថតទីតាំង:',
          '通知': 'សេចក្តីជូនដំណឹង:',
          '未查询到地址信息': 'មិនបានរកឃើញព័ត៌មានអាសយដ្ឋានទេ',
          '客户无定位信息': 'អតិថិជនមិនមានព័ត៌មានអំពីទីតាំងទេ',
          '运单编号/会员编号': 'លេខកូដ Waybill / លេខកូដសមាជិក',
          '数据加载中..': 'ទិន្នន័យកំពុងផ្ទុក..',
          '网络错误': 'កំហុសអ៊ីនធឺណេត',
          '用户名或者密码错误!': 'ឈ្មោះអ្នកប្រើឬពាក្យសម្ងាត់មិនត្រឹមត្រូវ',
          '请求失败! 请稍后尝试!': 'ការស្នើបានបរាជ័យ! សូមព្យាយាមពេលក្រោយ!',
        },
        'en_US': {
          '首页': 'Home',
        }
      };
}
